&НаКлиенте
Процедура СчетаУчетаРасчетаСКонтрагентамиСчетУчетаПриИзменении(Элемент)
	ИдСтроки = Элементы.СчетаУчетаРасчетаСКонтрагентами.ТекущаяСтрока;
	ОбновитьКодСчета(ИдСтроки);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКодСчета(ИдСтроки)
	ТекСтрока = Объект.СчетаУчетаРасчетаСКонтрагентами.НайтиПоИдентификатору(ИдСтроки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("СчетУчета", ТекСтрока.СчетУчета);
	
	ДанныеСчета = Новый Массив;
	ДанныеСчета.Добавить(Отбор.СчетУчета);
	
	Если ЗначениеЗаполнено(ТекСтрока.СчетУчета) Тогда
		КодСчета = ДанныеСчета[0].Код;
		ТекСтрока.КодСчета = КодСчета;
	Иначе
		ТекСтрока.КодСчета = "";
	КонецЕсли;
	
КонецПроцедуры