Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Нерезидент Тогда
		ДвиженияИРасчетКоэффициентовНеРезидентов(Отказ);
	Иначе   
		ДвиженияРезидентов(Отказ);
	КонецЕсли;
	  
КонецПроцедуры 

Процедура ДвиженияРезидентов(Отказ)     
   
   Движения.афлБухгалтерскаяОтчетностьКонтрагентов.Записывать = Истина;
   Движения.афлФинансовыеКоэффициентыКонтрагентов.Записывать = Истина; 
   
   Запрос = Новый Запрос;
   Запрос.Текст = 
   "ВЫБРАТЬ
   |	афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.СтрокаФормыОтчетности КАК СтрокаФормыОтчетности,
   |	СУММА(афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.СуммаСтроки) КАК СуммаСтроки,
   |	афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.Ссылка.Контрагент КАК Контрагент
   |ПОМЕСТИТЬ ДанныеДокумента
   |ИЗ
   |	Документ.афлОтчетностьКонтрагентов.ДанныеОтчетностиРезидентов КАК афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов
   |ГДЕ
   |	афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.Ссылка = &СсылкаНаДокумент
   |
   |СГРУППИРОВАТЬ ПО
   |	афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.СтрокаФормыОтчетности,
   |	афлОтчетностьКонтрагентовДанныеОтчетностиРезидентов.Ссылка.Контрагент
   |
   |ИНДЕКСИРОВАТЬ ПО
   |	Контрагент,
   |	СтрокаФормыОтчетности
   |;
   |
   |////////////////////////////////////////////////////////////////////////////////
   |ВЫБРАТЬ
   |	афлБухгалтерскаяОтчетностьКонтрагентовСрезПоследних.СтрокаФормыОтчетности КАК СтрокаФормыОтчетности,
   |	афлБухгалтерскаяОтчетностьКонтрагентовСрезПоследних.СуммаСтроки КАК СуммаСтроки
   |ПОМЕСТИТЬ ДанныеПрошлогоПериода
   |ИЗ
   |	РегистрСведений.афлБухгалтерскаяОтчетностьКонтрагентов.СрезПоследних(
   |			,
   |			ПериодОтчетности = &ПериодОтчетности
   |				И Контрагент В
   |					(ВЫБРАТЬ
   |						ДанныеДокумента.Контрагент КАК Контрагент
   |					ИЗ
   |						ДанныеДокумента КАК ДанныеДокумента)) КАК афлБухгалтерскаяОтчетностьКонтрагентовСрезПоследних
   |
   |ИНДЕКСИРОВАТЬ ПО
   |	СтрокаФормыОтчетности
   |;
   |
   |////////////////////////////////////////////////////////////////////////////////
   |ВЫБРАТЬ
   |	ВЫРАЗИТЬ(ДанныеДокумента.СтрокаФормыОтчетности КАК Справочник.афлСтрокиБухгалтерскойОтчетности) КАК СтрокаФормыОтчетности,
   |	ДанныеДокумента.СуммаСтроки КАК СуммаСтроки,
   |	ЕСТЬNULL(ДанныеПрошлогоПериода.СуммаСтроки, 0) КАК СуммаСтрокиПрошлогоПериода
   |ИЗ
   |	ДанныеДокумента КАК ДанныеДокумента
   |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПрошлогоПериода КАК ДанныеПрошлогоПериода
   |		ПО ДанныеДокумента.СтрокаФормыОтчетности = ДанныеПрошлогоПериода.СтрокаФормыОтчетности";
   
   Запрос.УстановитьПараметр("СсылкаНаДокумент", Ссылка);  
   Запрос.УстановитьПараметр("ПериодОтчетности",
	   ПериодыУХ.ПолучитьПериодПоСдвигу(ПериодОтчетности.ДатаНачала, -1 , Перечисления.Периодичность.Год));
   
   РезультатЗапроса = Запрос.Выполнить();
   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
   
   ТаблицаРезультат = РезультатЗапроса.Выгрузить();
   Если ОтчетностьЗаПрошлыйПериодОтсутсвует = Ложь И ТаблицаРезультат.Итог("СуммаСтрокиПрошлогоПериода") = 0 Тогда 
	   Отказ = Истина;
	   ОбщегоНазначения.СообщитьПользователю("Отсутствуют данные за прошлый период!");
	   Возврат;
   КонецЕсли;
   
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
	   Движение = Движения.афлБухгалтерскаяОтчетностьКонтрагентов.Добавить();	
	   Движение.Период = Дата; 
	   Движение.Контрагент = Контрагент;
	   Движение.СтрокаФормыОтчетности = ВыборкаДетальныеЗаписи.СтрокаФормыОтчетности;
	   Движение.ПериодОтчетности = ПериодОтчетности;
	   Движение.СуммаСтроки = ВыборкаДетальныеЗаписи.СуммаСтроки;
   КонецЦикла;
   
   // Строки для рассчета К1-К5
	Строка2400параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ЧистаяПрибыльИлиУбыток;
   Строка2110параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.Выручка;
   
   Строка1200параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ОборотныеАктивы;
   Строка1500параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.КраткосрочныеОбязательства;   
   
   Строка1600параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.БАЛАНС; 
   Строка1400параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ИтогоДолгосрочныхОбязательств; 
   Строка1530параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ДоходыБудущихПериодов;    
   
   Строка1230параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ДебиторскаяЗадолженность;
   Строка1100параметр = Справочники.афлСтрокиБухгалтерскойОтчетности.ИтогоВнеоборотныхАктивов;
   
	Строка2400 = ТаблицаРезультат.Найти(Строка2400параметр, "СтрокаФормыОтчетности"); 
   Строка2110 = ТаблицаРезультат.Найти(Строка2110параметр, "СтрокаФормыОтчетности");  
   
   Строка1200 = ТаблицаРезультат.Найти(Строка1200параметр, "СтрокаФормыОтчетности"); 
   Строка1500 = ТаблицаРезультат.Найти(Строка1500параметр, "СтрокаФормыОтчетности");  
   
   Строка1600 = ТаблицаРезультат.Найти(Строка1600параметр, "СтрокаФормыОтчетности");
   Строка1400 = ТаблицаРезультат.Найти(Строка1400параметр, "СтрокаФормыОтчетности");
   Строка1530 = ТаблицаРезультат.Найти(Строка1530параметр, "СтрокаФормыОтчетности");
   
   Строка1230 = ТаблицаРезультат.Найти(Строка1230параметр, "СтрокаФормыОтчетности");
   Строка1100 = ТаблицаРезультат.Найти(Строка1100параметр, "СтрокаФормыОтчетности");
   
   Строка2400СуммаСтроки = ?(Строка2400 = Неопределено, 0 , Строка2400.СуммаСтроки);
   Строка2110СуммаСтроки = ?(Строка2110 = Неопределено, 0 , Строка2110.СуммаСтроки);  
   Строка1200СуммаСтроки = ?(Строка1200 = Неопределено, 0 , Строка1200.СуммаСтроки);
   Строка1500СуммаСтроки = ?(Строка1500 = Неопределено, 0 , Строка1500.СуммаСтроки);
   Строка1600СуммаСтроки = ?(Строка1600 = Неопределено, 0 , Строка1600.СуммаСтроки);
   Строка1400СуммаСтроки = ?(Строка1400 = Неопределено, 0 , Строка1400.СуммаСтроки);
   Строка1530СуммаСтроки = ?(Строка1530 = Неопределено, 0 , Строка1530.СуммаСтроки);
   Строка1230СуммаСтроки = ?(Строка1230 = Неопределено, 0 , Строка1230.СуммаСтроки);
   Строка1100СуммаСтроки = ?(Строка1100 = Неопределено, 0 , Строка1100.СуммаСтроки);      
   
   Строка2400СуммаСтрокиПрошлогоПериода = ?(Строка2400 = Неопределено, 0 , Строка2400.СуммаСтрокиПрошлогоПериода);
   Строка2110СуммаСтрокиПрошлогоПериода = ?(Строка2110 = Неопределено, 0 , Строка2110.СуммаСтрокиПрошлогоПериода);  
   Строка1200СуммаСтрокиПрошлогоПериода = ?(Строка1200 = Неопределено, 0 , Строка1200.СуммаСтрокиПрошлогоПериода);
   Строка1500СуммаСтрокиПрошлогоПериода = ?(Строка1500 = Неопределено, 0 , Строка1500.СуммаСтрокиПрошлогоПериода);
   Строка1600СуммаСтрокиПрошлогоПериода = ?(Строка1600 = Неопределено, 0 , Строка1600.СуммаСтрокиПрошлогоПериода);
   Строка1400СуммаСтрокиПрошлогоПериода = ?(Строка1400 = Неопределено, 0 , Строка1400.СуммаСтрокиПрошлогоПериода);
   Строка1530СуммаСтрокиПрошлогоПериода = ?(Строка1530 = Неопределено, 0 , Строка1530.СуммаСтрокиПрошлогоПериода);
   Строка1230СуммаСтрокиПрошлогоПериода = ?(Строка1230 = Неопределено, 0 , Строка1230.СуммаСтрокиПрошлогоПериода);
   Строка1100СуммаСтрокиПрошлогоПериода = ?(Строка1100 = Неопределено, 0 , Строка1100.СуммаСтрокиПрошлогоПериода);
   
   K1 = 0; 
   К2 = 0; 
   К3 = 0; 
   К4 = 0; 
   К5 = 0; 
   КФин = 0; 
   
   // К1
   Если Строка2110СуммаСтроки = 0 Тогда
	   К1 = 0;
   Иначе
		К1Параметр = ?(Строка2110СуммаСтроки = 0, 0, Строка2400СуммаСтроки / Строка2110СуммаСтроки); 
	   
		Если К1Параметр > 0.15 Тогда 
		   К1 = 1;
	   ИначеЕсли К1Параметр > 0.1 И К1Параметр <= 0.15 Тогда 
		   К1 = 4 / 5;
	   ИначеЕсли К1Параметр > 0.05 И К1Параметр <= 0.1 Тогда
		   К1 = 3 / 5;
	   ИначеЕсли К1Параметр > 0 И К1Параметр <= 0.05 Тогда
		   К1 = 2 / 5;
	   ИначеЕсли К1Параметр > -0.05 И К1Параметр <= 0 Тогда
		   К1 = 1 / 5;
	   ИначеЕсли К1Параметр <= -0.05 Тогда
		   К1 = 0;
		Иначе
			К1 = 0;
	   КонецЕсли; 
   КонецЕсли;  
	
   // К2
   К2Параметр = ?(Строка1500СуммаСтроки = 0, 0, Строка1200СуммаСтроки / Строка1500СуммаСтроки); 
   
	Если К2Параметр > 4 Тогда 
	   К2 = 3 / 5;
   ИначеЕсли К2Параметр > 2.5 И К2Параметр <= 4 Тогда 
	   К2 = 4 / 5;
   ИначеЕсли К2Параметр > 1.5 И К2Параметр <= 2.5 Тогда
	   К2 = 1;
   ИначеЕсли К2Параметр > 1 И К2Параметр <= 1.5 Тогда
	   К2 = 2 / 5;
   ИначеЕсли К2Параметр > 0.5 И К2Параметр <= 1 Тогда
	   К2 = 1 / 5;
   ИначеЕсли К2Параметр <= 0.05 Тогда
	   К2 = 0;  
   Иначе
	   К2 = 0;  
   КонецЕсли;
   
   // К3
   ЗУ = 0;
   ЧА = (Строка1600СуммаСтроки - ЗУ) - (Строка1400СуммаСтроки + Строка1500СуммаСтроки - Строка1530СуммаСтроки); 
   ЧАпп = (Строка1600СуммаСтрокиПрошлогоПериода - ЗУ) - (Строка1400СуммаСтрокиПрошлогоПериода
									   + Строка1500СуммаСтрокиПрошлогоПериода - Строка1530СуммаСтрокиПрошлогоПериода);
   
   Рост = ЧАпп * 100;
   
   Если Рост > 10 Тогда 
	   К3 = 1;
   ИначеЕсли Рост > 5 И Рост <= 10 Тогда 
	   К3 = 4 / 5;
   ИначеЕсли Рост > 0 И К1Параметр <= 5 Тогда
	   К3 = 3 / 5;
   ИначеЕсли Рост > -5 И Рост <= 0 Тогда
	   К3 = 2 / 5;
   ИначеЕсли Рост > -10 И Рост <= -5 Тогда
	   К3 = 1 / 5;
   ИначеЕсли Рост <= -10 Тогда
	   К3 = 0;  
   Иначе
	   К3 = 0;  
   КонецЕсли;
   
   // К4
   К4Параметр = ?((Строка2110СуммаСтроки / 12) = 0 , 0 , ((Строка1230СуммаСтрокиПрошлогоПериода + Строка1230СуммаСтроки) 
																   * 0.5 * (365 / 12)) / (Строка2110СуммаСтроки / 12));
   
   Если К4Параметр < 30 Тогда 
	   К4 = 1;
   ИначеЕсли К4Параметр >= 30 И К4Параметр < 60 Тогда 
	   К4 = 4 / 5;
   ИначеЕсли К4Параметр >= 60 И К4Параметр < 90 Тогда 
	   К4 = 3 / 5;
   ИначеЕсли К4Параметр >= 90 И К4Параметр < 120 Тогда 
	   К4 = 2 / 5;
   ИначеЕсли К4Параметр >= 120 И К4Параметр < 180 Тогда 
	   К4 = 1 / 5;
   ИначеЕсли К4Параметр >= 180 Тогда
	   К4 = 0;  
   Иначе
	   К4 = 0;  
   КонецЕсли;
   
   // К5
   К5Параметр = ?(Строка1200СуммаСтроки = 0, 0, (ЧА - Строка1100СуммаСтроки) / Строка1200СуммаСтроки);
   
   Если  Строка1100СуммаСтроки = 0 Тогда
	   К5 = 0;
   Иначе
		Если К5Параметр > 0.3 Тогда 
		   К5 = 1;
	   ИначеЕсли К5Параметр > 0.15 И К5Параметр <= 0.3 Тогда 
		   К5 = 4 / 5;
	   ИначеЕсли К5Параметр > 0.1 И К5Параметр <= 0.15 Тогда 
		   К5 = 3 / 5;
	   ИначеЕсли К5Параметр > 0.05 И К5Параметр <= 0.1 Тогда 
		   К5 = 2 / 5;
	   ИначеЕсли К5Параметр > 0 И К5Параметр <= 0.05 Тогда 
		   К5 = 1 / 5;
	   ИначеЕсли К5Параметр <= 0 Тогда
		   К5 = 0;  
	   Иначе
		   К5 = 0;  
	   КонецЕсли;   
   КонецЕсли;
   
   // ++Кирилл исправит
   // Если КредитнаяГруппаКонтрагента = Тогда  
   // Кфин = 1; 
   // Иначе
   // Кфин = (0.2 * К1) + (0.2 * к2) + (0.2 * к3) + (0.2 * к4) + (0.2 * к5); 
   // КонецЕсли;
   // --Кирилл исправит

   Движение = Движения.афлФинансовыеКоэффициентыКонтрагентов.Добавить();	
   Движение.Контрагент = Контрагент; 
   Движение.Период = Дата; 
   Движение.ПериодОтчетности = ПериодОтчетности; 
   Движение.К1 = К1; 
   Движение.К2 = К2; 
   Движение.К3 = К3; 
   Движение.К4 = К4; 
   Движение.К5 = К5; 
   Движение.КФин = Кфин; 
   
КонецПроцедуры