#Область СлужебныйПрограммныйИнтерфейс

// Получить расположение папки банковские выписки к загрузке.
// 
// Возвращаемое значение:
//  Произвольный, Строка - расположение папки банковские выписки к загрузке
Функция ПолучитьРасположениеПапкиБанковскиеВыпискиКЗагрузке() Экспорт
	Возврат Константы.афлРасположениеПапкиБанковскиеВыпискиКЗагрузке.Получить();
КонецФункции

// Получить предопределенный элемент ПВХКазначейство.
// 
// Параметры:
//  ИмяПредопределенныхДанных - Строка - имя предопределенного элемента
// 
// Возвращаемое значение:
//  Произвольный, Строка - значение предопределенного элемента
Функция ПолучитьПредопределенныйЭлементПВХКазначейство(ИмяПредопределенныхДанных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	афлПредопределенныеНастройкиКазначейство.Значение КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.афлПредопределенныеНастройкиКазначейство КАК афлПредопределенныеНастройкиКазначейство
		|ГДЕ
		|	афлПредопределенныеНастройкиКазначейство.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенныхДанных);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			
			Значение = Выборка.Значение;
			
			Возврат Значение;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
#КонецОбласти