// АФЛ Казначейство
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//
&НаКлиентеНаСервереБезКонтекста
Процедура ИзменяемДоступностьРеквизитов(Форма)
	
	Элементы	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	ЭтоСтранаСША 	= Ложь;
	ЭтоСтранаРФ 	= Объект.Страна 	= Форма.СтранаРФ;
	
	Если Не Форма.афлСтранаСША.Пустая() Тогда
		ЭтоСтранаСША 	= Объект.Страна 	= Форма.афлСтранаСША;
	КонецЕсли;
	
	Элементы.афлКодABA.Доступность 		= ЭтоСтранаСША;
	
	Элементы.афлИНН.Доступность 		= ЭтоСтранаРФ;
	Элементы.афлКПП.Доступность 		= ЭтоСтранаРФ;
	
КонецПроцедуры
// АФЛ Казначейство

// АФЛ Казначейство