&НаСервере
Процедура УстановитьДанныеЭлементовШапки()
	
	Если Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		Объект.ПККДЗАвансам 				= Справочники.афлПризнакКредитногоКачества.ПустаяСсылка();
		Объект.ТипЛимита 					= Справочники.афлТипыЛимитов.ПустаяСсылка();
		Объект.КредитнаяГруппаКонтрагента 	= Справочники.афлКредитныеГруппыКонтрагентов.ПустаяСсылка();
		
		ОбновитьВидимостьТипЛимитаПриИзменении();
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлАнкетыКонтрагента.ТипЛимита КАК ТипЛимита,
		|	афлАнкетыКонтрагента.КредитнаяГруппаКонтрагентов КАК КредитнаяГруппаКонтрагента,
		|	ВЫБОР
		|		КОГДА &ВидЛимита = ЗНАЧЕНИЕ(Перечисление.афлВидыЛимитов.ЛимитДЗ)
		|			ТОГДА афлАнкетыКонтрагента.ПККДЗ
		|		ИНАЧЕ афлАнкетыКонтрагента.ПККПоАвансам
		|	КОНЕЦ КАК ПКК
		|ИЗ
		|	Справочник.афлАнкетыКонтрагента КАК афлАнкетыКонтрагента
		|ГДЕ
		|	афлАнкетыКонтрагента.Владелец = &Контрагент";
	
	Запрос.УстановитьПараметр("ВидЛимита", Объект.ВидЛимита);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ПККДЗАвансам 				= Выборка.ПКК;
		Объект.ТипЛимита 					= Выборка.ТипЛимита;
		Объект.КредитнаяГруппаКонтрагента 	= Выборка.КредитнаяГруппаКонтрагента;
	КонецЕсли;
	
	ОбновитьВидимостьТипЛимитаПриИзменении();
	
КонецПроцедуры