ВЫБРАТЬ
	афлЗаблокированныеЗНО.Период КАК Период,
	афлЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	афлЗаблокированныеЗНО.ЗаявкаНаОплату.Контрагент КАК Контрагент,
	афлЗаблокированныеЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
	афлЗаблокированныеЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ОтборЗНО
ИЗ
	РегистрСведений.афлЗаблокированныеЗНО КАК афлЗаблокированныеЗНО
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	ВТ_ОтборЗНО.Период КАК Период,
	ВТ_ОтборЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ОтборЗНО.Контрагент КАК Контрагент,
	ВТ_ОтборЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ОтборЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ЗаблокированныеЗНО
ИЗ
	ВТ_ОтборЗНО КАК ВТ_ОтборЗНО
ГДЕ
	ВТ_ОтборЗНО.БлокировкаДЗ = ИСТИНА
	ИЛИ ВТ_ОтборЗНО.БлокировкаАвансирования = ИСТИНА
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ЗаблокированныеЗНО.Период КАК Период,
	ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ЗаблокированныеЗНО.Контрагент КАК Контрагент,
	ВТ_ЗаблокированныеЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ЗаблокированныеЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ЗаявкиНаОплату
ИЗ
	ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		ПО ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
ГДЕ
	(ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ЛОЖЬ
			ИЛИ ЗаявкаНаРасходованиеДенежныхСредств.Проведен = ИСТИНА)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования КАК ДокументПланирования,
	СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения КАК СостояниеИсполнения
ПОМЕСТИТЬ ВТ_НеИсполненныеЗНО
ИЗ
	РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних(
			,
			ДокументПланирования В
				(ВЫБРАТЬ
					ВТ_ЗаявкиНаОплату.ЗаявкаНаОплату КАК ЗаявкаНаОплату
				ИЗ
					ВТ_ЗаявкиНаОплату КАК ВТ_ЗаявкиНаОплату)) КАК СостоянияИсполненияДокументовПланированияСрезПоследних
ГДЕ
	СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения <> ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.Исполнена)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ЗаявкиНаОплату.Период КАК Период,
	ВТ_ЗаявкиНаОплату.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ЗаявкиНаОплату.Контрагент КАК Контрагент,
	ВТ_ЗаявкиНаОплату.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ЗаявкиНаОплату.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ОтборНеИсполненныхЗНО
ИЗ
	ВТ_ЗаявкиНаОплату КАК ВТ_ЗаявкиНаОплату
ГДЕ
	ВТ_ЗаявкиНаОплату.ЗаявкаНаОплату В
			(ВЫБРАТЬ
				ВТ_НеИсполненныеЗНО.ДокументПланирования КАК ДокументПланирования
			ИЗ
				ВТ_НеИсполненныеЗНО КАК ВТ_НеИсполненныеЗНО)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	РегистрСостоянийОбъектовСрезПоследних.Объект КАК Объект,
	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
ПОМЕСТИТЬ ВТ_ЗНОВСтатусеЧерновик
ИЗ
	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(
			,
			Объект В
				(ВЫБРАТЬ
					ВТ_ОтборНеИсполненныхЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
				ИЗ
					ВТ_ОтборНеИсполненныхЗНО КАК ВТ_ОтборНеИсполненныхЗНО)) КАК РегистрСостоянийОбъектовСрезПоследних
ГДЕ
	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Черновик)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ОтборНеИсполненныхЗНО.Период КАК Период,
	ВТ_ОтборНеИсполненныхЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ОтборНеИсполненныхЗНО.Контрагент КАК Контрагент,
	ВТ_ОтборНеИсполненныхЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ОтборНеИсполненныхЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ОтборЗНОВСтатусеНеЧерновик
ИЗ
	ВТ_ОтборНеИсполненныхЗНО КАК ВТ_ОтборНеИсполненныхЗНО
ГДЕ
	ВТ_ОтборНеИсполненныхЗНО.ЗаявкаНаОплату В
			(ВЫБРАТЬ
				ВТ_ЗНОВСтатусеЧерновик.Объект КАК Объект
			ИЗ
				ВТ_ЗНОВСтатусеЧерновик КАК ВТ_ЗНОВСтатусеЧерновик)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Контрагент КАК Контрагент,
	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Заблокирован КАК Заблокирован
ПОМЕСТИТЬ ВТ_РазблокированныеКонтрагенты
ИЗ
	РегистрСведений.афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентам.СрезПоследних(
			,
			Контрагент В
				(ВЫБРАТЬ
					ВТ_ОтборЗНОВСтатусеНеЧерновик.Контрагент КАК ЗаявкаНаОплатуКонтрагент
				ИЗ
					ВТ_ОтборЗНОВСтатусеНеЧерновик КАК ВТ_ОтборЗНОВСтатусеНеЧерновик)) КАК афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних
ГДЕ
	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Заблокирован = ИСТИНА
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ОтборЗНОВСтатусеНеЧерновик.Период КАК Период,
	ВТ_ОтборЗНОВСтатусеНеЧерновик.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ОтборЗНОВСтатусеНеЧерновик.Контрагент КАК Контрагент,
	ВТ_ОтборЗНОВСтатусеНеЧерновик.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ОтборЗНОВСтатусеНеЧерновик.БлокировкаАвансирования КАК БлокировкаАвансирования
ПОМЕСТИТЬ ВТ_ОтборНеРазблокированныеКонтрагенты
ИЗ
	ВТ_ОтборЗНОВСтатусеНеЧерновик КАК ВТ_ОтборЗНОВСтатусеНеЧерновик
ГДЕ
	ВТ_ОтборЗНОВСтатусеНеЧерновик.Контрагент В
			(ВЫБРАТЬ
				ВТ_РазблокированныеКонтрагенты.Контрагент КАК Контрагент
			ИЗ
				ВТ_РазблокированныеКонтрагенты КАК ВТ_РазблокированныеКонтрагенты)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ОтборЗНО.Период КАК Период,
	ВТ_ОтборЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ОтборЗНО.Контрагент КАК Контрагент,
	ВТ_ОтборЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
	ВТ_ОтборЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
ИЗ
	ВТ_ОтборЗНО КАК ВТ_ОтборЗНО
ГДЕ
	НЕ ВТ_ОтборЗНО.ЗаявкаНаОплату В
				(ВЫБРАТЬ
					ВТ_ОтборНеРазблокированныеКонтрагенты.ЗаявкаНаОплату КАК ЗаявкаНаОплату
				ИЗ
					ВТ_ОтборНеРазблокированныеКонтрагенты КАК ВТ_ОтборНеРазблокированныеКонтрагенты);

Процедура ОбновитьЗаписьЗаблокированнойЗНОПоКонтролюДЗ(ДанныеЗаполнения, КонтрольДЗПройден) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолучитьЗаблокированныеЗНО();
	
	Запрос.УстановитьПараметр("ЗаявкаНаОплату", ДанныеЗаполнения.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НаборЗаписей = РегистрыСведений.афлЗаблокированныеЗНО.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ЗаявкаНаОплату.Установить(Выборка.ЗаявкаНаОплату);
		
		НаборЗаписей.Прочитать();
		
		НаборЗаписей[0].ДатаПроверкиЗНО = ТекущаяДатаСеанса();
		НаборЗаписей[0].СуммаЗНОВРублях = ПолучитьСуммуЗНОВРублях(
											ДанныеЗаполнения.ВалютаВзаиморасчетов, ДанныеЗаполнения.СуммаДокумента);
		НаборЗаписей[0].БлокировкаДЗ 	= Не КонтрольДЗПройден;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры