Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровРасчетаЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровРасчетаЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровРасчетаЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровРасчетаЛимитовСтатусыДоговора.СтатусДоговора КАК СтатусДоговора,
		|	афлУстановкаПараметровРасчетаЛимитовТипыДоговора.ТипДоговора КАК ТипДоговора
		|ИЗ
		|	Документ.афлУстановкаПараметровРасчетаЛимитов КАК афлУстановкаПараметровРасчетаЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровРасчетаЛимитов.СтатусыДоговора КАК афлУстановкаПараметровРасчетаЛимитовСтатусыДоговора
		|		ПО афлУстановкаПараметровРасчетаЛимитов.Ссылка = афлУстановкаПараметровРасчетаЛимитовСтатусыДоговора.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровРасчетаЛимитов.ТипыДоговора КАК афлУстановкаПараметровРасчетаЛимитовТипыДоговора
		|		ПО афлУстановкаПараметровРасчетаЛимитов.Ссылка = афлУстановкаПараметровРасчетаЛимитовТипыДоговора.Ссылка
		|ГДЕ
		|	афлУстановкаПараметровРасчетаЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровРасчетаЛимитовСчетаДляРасчетаОборотов.Ссылка.Дата КАК Период,
		|	афлУстановкаПараметровРасчетаЛимитовСчетаДляРасчетаОборотов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровРасчетаЛимитовСчетаДляРасчетаОборотов.КодСчета КАК СчетРасчетаИКонтроля,
		|	&СчетаДляРасчетаОборотов КАК СценарийРасчетаИКонтроляЛимитов
		|ИЗ
		|	Документ.афлУстановкаПараметровРасчетаЛимитов.СчетаДляРасчетаОборотов КАК афлУстановкаПараметровРасчетаЛимитовСчетаДляРасчетаОборотов
		|ГДЕ
		|	афлУстановкаПараметровРасчетаЛимитовСчетаДляРасчетаОборотов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровРасчетаЛимитовСчетаИсключенияИзОборотов.Ссылка.Дата КАК Период,
		|	афлУстановкаПараметровРасчетаЛимитовСчетаИсключенияИзОборотов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровРасчетаЛимитовСчетаИсключенияИзОборотов.КодСчета КАК СчетРасчетаИКонтроля,
		|	&СчетаИсключенияИзОборотов КАК СценарийРасчетаИКонтроляЛимитов
		|ИЗ
		|	Документ.афлУстановкаПараметровРасчетаЛимитов.СчетаИсключенияИзОборотов КАК афлУстановкаПараметровРасчетаЛимитовСчетаИсключенияИзОборотов
		|ГДЕ
		|	афлУстановкаПараметровРасчетаЛимитовСчетаИсключенияИзОборотов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровРасчетаЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровРасчетаЛимитов.Ссылка КАК Регистратор,
		|	&РасчетЛимита КАК ВидПараметра
		|ИЗ
		|	Документ.афлУстановкаПараметровРасчетаЛимитов КАК афлУстановкаПараметровРасчетаЛимитов
		|ГДЕ
		|	афлУстановкаПараметровРасчетаЛимитов.Ссылка = &Ссылка";