Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	&КонтрольЛимита КАК ВидПараметра
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.Ссылка.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.КодСчета КАК СчетРасчетаИКонтроля,
		|	&СчетаУчетаРасчетовСКонтрагентами КАК СценарийРасчетаИКонтроляЛимитов
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаРасчетаСКонтрагентами КАК афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.Ссылка.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.КодСчета КАК СчетРасчетаИКонтроля,
		|	&СчетаУчетаФинОбеспПолученного КАК СценарийРасчетаИКонтроляЛимитов
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаФинансовогоОбеспеченияПолученного КАК афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.Ссылка.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.КодСчета КАК СчетРасчетаИКонтроля,
		|	&СчетаИсключенияДляКонтроляЛимитов КАК СценарийРасчетаИКонтроляЛимитов
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаИсключения КАК афлУстановкаПараметровКонтроляЛимитовСчетаИсключения
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитов.ПорогПредупрежденияВПроцентах КАК ПорогПредупрежденияВПроцентах,
		|	афлУстановкаПараметровКонтроляЛимитов.СрокОтсрочки КАК СрокОтсрочки,
		|	афлУстановкаПараметровКонтроляЛимитов.ИсключатьБанкротов КАК ИсключатьБанкротов
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка";
