Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлЗаблокированныеЗНО.Период КАК Период,
		|	афлЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	афлЗаблокированныеЗНО.ЗаявкаНаОплату.Контрагент КАК Контрагент,
		|	афлЗаблокированныеЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
		|	афлЗаблокированныеЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеЗНО
		|ИЗ
		|	РегистрСведений.афлЗаблокированныеЗНО КАК афлЗаблокированныеЗНО
		|;
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования КАК ДокументПланирования,
		|	СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения КАК СостояниеИсполнения
		|ПОМЕСТИТЬ ВТ_ИсполненныеЗНО
		|ИЗ
		|	РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних(
		|			,
		|			ДокументПланирования В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|				ИЗ
		|					ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)) КАК СостоянияИсполненияДокументовПланированияСрезПоследних
		|ГДЕ
		|	СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.Исполнена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСостоянийОбъектовСрезПоследних.Объект КАК Объект,
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
		|ПОМЕСТИТЬ ВТ_ЗНОВСтатусеЧерновик
		|ИЗ
		|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(
		|			,
		|			Объект В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|				ИЗ
		|					ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)) КАК РегистрСостоянийОбъектовСрезПоследних
		|ГДЕ
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Черновик)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Контрагент КАК Контрагент,
		|	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Заблокирован КАК Заблокирован
		|ПОМЕСТИТЬ ВТ_РазблокированныеКонтрагенты
		|ИЗ
		|	РегистрСведений.афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентам.СрезПоследних(
		|			,
		|			Контрагент В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату.Контрагент КАК ЗаявкаНаОплатуКонтрагент
		|				ИЗ
		|					ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)) КАК афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних
		|ГДЕ
		|	афлИсторияРасчетовДебиторскойЗадолжностиПоКонтрагентамСрезПоследних.Заблокирован = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|ПОМЕСТИТЬ ВТ_РазблокированныеЗНО
		|ИЗ
		|	ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО
		|ГДЕ
		|	ВТ_ЗаблокированныеЗНО.БлокировкаДЗ = ЛОЖЬ
		|	И ВТ_ЗаблокированныеЗНО.БлокировкаАвансирования = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗаявкиНаОплату
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	(ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ИСТИНА
		|			ИЛИ ЗаявкаНаРасходованиеДенежныхСредств.Проведен = ЛОЖЬ)
		|	И ЗаявкаНаРасходованиеДенежныхСредств.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|			ИЗ
		|				ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаблокированныеЗНО.Период КАК Период,
		|	ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
		|	ВТ_ЗаблокированныеЗНО.БлокировкаДЗ КАК БлокировкаДЗ,
		|	ВТ_ЗаблокированныеЗНО.БлокировкаАвансирования КАК БлокировкаАвансирования,
		|	ВТ_ЗаблокированныеЗНО.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО
		|ГДЕ
		|	(ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаявкиНаОплату.Ссылка КАК Ссылка
		|				ИЗ
		|					ВТ_ЗаявкиНаОплату КАК ВТ_ЗаявкиНаОплату)
		|			ИЛИ ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату В
		|				(ВЫБРАТЬ
		|					ВТ_ИсполненныеЗНО.ДокументПланирования КАК ДокументПланирования
		|				ИЗ
		|					ВТ_ИсполненныеЗНО КАК ВТ_ИсполненныеЗНО)
		|			ИЛИ ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату В
		|				(ВЫБРАТЬ
		|					ВТ_ЗНОВСтатусеЧерновик.Объект КАК Объект
		|				ИЗ
		|					ВТ_ЗНОВСтатусеЧерновик КАК ВТ_ЗНОВСтатусеЧерновик)
		|			ИЛИ ВТ_ЗаблокированныеЗНО.Контрагент В
		|				(ВЫБРАТЬ
		|					ВТ_РазблокированныеКонтрагенты.Контрагент КАК Контрагент
		|				ИЗ
		|					ВТ_РазблокированныеКонтрагенты КАК ВТ_РазблокированныеКонтрагенты)
		|			ИЛИ ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату В
		|				(ВЫБРАТЬ
		|					ВТ_РазблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		|				ИЗ
		|					ВТ_РазблокированныеЗНО КАК ВТ_РазблокированныеЗНО))";