ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлЗаблокированныеЗНО.Период КАК Период,
	афлЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	афлЗаблокированныеЗНО.ВалютаЗНО КАК ВалютаЗНО,
	афлЗаблокированныеЗНО.СуммаЗНОВВалюте КАК СуммаЗНОВВалюте
ПОМЕСТИТЬ ВТ_ЗаблокированныеЗНО
ИЗ
	РегистрСведений.афлЗаблокированныеЗНО КАК афлЗаблокированныеЗНО
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования КАК ДокументПланирования,
	СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения КАК СостояниеИсполнения
ПОМЕСТИТЬ ВТ_ИсполненныеЗНО
ИЗ
	РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних(, ДокументПланирования В
		(ВЫБРАТЬ
			ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		ИЗ
			ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)
	И СостояниеИсполнения = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.Исполнена)) КАК
		СостоянияИсполненияДокументовПланированияСрезПоследних
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	РегистрСостоянийОбъектовСрезПоследних.Объект КАК Объект,
	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
ПОМЕСТИТЬ ВТ_ЗНОВСтатусеЧерновик
ИЗ
	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект В
		(ВЫБРАТЬ
			ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату
		ИЗ
			ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО)
	И СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Черновик)) КАК РегистрСостоянийОбъектовСрезПоследних
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ЗаблокированныеЗНО.Период КАК Период,
	ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	ВТ_ЗаблокированныеЗНО.ВалютаЗНО КАК ВалютаЗНО,
	ВТ_ЗаблокированныеЗНО.СуммаЗНОВВалюте КАК СуммаЗНОВВалюте
ИЗ
	ВТ_ЗаблокированныеЗНО КАК ВТ_ЗаблокированныеЗНО
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		ПО ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсполненныеЗНО КАК ВТ_ИсполненныеЗНО
		ПО ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату = ВТ_ИсполненныеЗНО.ДокументПланирования
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗНОВСтатусеЧерновик КАК ВТ_ЗНОВСтатусеЧерновик
		ПО ВТ_ЗаблокированныеЗНО.ЗаявкаНаОплату = ВТ_ЗНОВСтатусеЧерновик.Объект
ГДЕ
	ЗаявкаНаРасходованиеДенежныхСредств.афлБлокировкаЛимита = ЛОЖЬ
	ИЛИ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ИСТИНА
	ИЛИ ЗаявкаНаРасходованиеДенежныхСредств.Проведен = ЛОЖЬ