Процедура ОбновитьДанныеДляПересчетаКачественныхКоэффициентов() Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алфКачественныеКоэффициентыКонтрагентовСрезПоследних.АнкетаКонтрагента КАК АнкетаКонтрагента,
		|	алфКачественныеКоэффициентыКонтрагентовСрезПоследних.АнкетаКонтрагента.Владелец КАК Контрагент,
		|	МАКСИМУМ(алфКачественныеКоэффициентыКонтрагентовСрезПоследних.Период) КАК ДатаПоследенегоРасчета,
		|	МАКСИМУМ(алфКачественныеКоэффициентыКонтрагентовСрезПоследних.НомерВерсии) КАК НомерВерсииПоследнегоРасчета
		|ПОМЕСТИТЬ ВТ_КонтрагентыПоследниеРасчеты
		|ИЗ
		|	РегистрСведений.афлКачественныеКоэффициентыКонтрагентов.СрезПоследних(, АнкетаКонтрагента.ПометкаУдаления = ЛОЖЬ) КАК
		|		алфКачественныеКоэффициентыКонтрагентовСрезПоследних
		|СГРУППИРОВАТЬ ПО
		|	алфКачественныеКоэффициентыКонтрагентовСрезПоследних.АнкетаКонтрагента,
		|	алфКачественныеКоэффициентыКонтрагентовСрезПоследних.АнкетаКонтрагента.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец В
		|		(ВЫБРАТЬ
		|			ВтКонтрагентыПоследниеРасчеты.Контрагент КАК Контрагент
		|		ИЗ
		|			ВТ_КонтрагентыПоследниеРасчеты КАК ВтКонтрагентыПоследниеРасчеты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(РегистрСостоянийОбъектовСрезПоследних.Объект КАК Справочник.ДоговорыКонтрагентов).Владелец КАК Контрагент,
		|	МИНИМУМ(ВЫРАЗИТЬ(РегистрСостоянийОбъектовСрезПоследних.Объект КАК
		|		Справочник.ДоговорыКонтрагентов).ДатаНачалаДействия) КАК ДатаНачалаДействия
		|ПОМЕСТИТЬ ВТ_ДатыНачалаДействияДоговоровПоКонтрагентам
		|ИЗ
		|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(&ТекущаяДата, ВЫРАЗИТЬ(Объект КАК
		|		Справочник.ДоговорыКонтрагентов) В
		|		(ВЫБРАТЬ
		|			ВТДоговорыКонтрагентов.Договор КАК Договор
		|		ИЗ
		|			ВТ_ДоговорыКонтрагентов КАК ВТДоговорыКонтрагентов)) КАК РегистрСостоянийОбъектовСрезПоследних
		|ГДЕ
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоров.Действующий)
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(РегистрСостоянийОбъектовСрезПоследних.Объект КАК Справочник.ДоговорыКонтрагентов).Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВтКонтрагентыПоследниеРасчеты.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ДатыНачалаДействияДоговоровПоКонтрагентам.ДатаНачалаДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК
		|		ТекущаяДатаПервогоДоговора,
		|	ВтКонтрагентыПоследниеРасчеты.НомерВерсииПоследнегоРасчета КАК НомерВерсииПоследнегоРасчета
		|ПОМЕСТИТЬ ВТ_ДоговораПервыеДатыДоговора
		|ИЗ
		|	ВТ_КонтрагентыПоследниеРасчеты КАК ВтКонтрагентыПоследниеРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыНачалаДействияДоговоровПоКонтрагентам КАК ДатыНачалаДействияДоговоровПоКонтрагентам
		|		ПО ВтКонтрагентыПоследниеРасчеты.Контрагент = ДатыНачалаДействияДоговоровПоКонтрагентам.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговораПервыеДатыДоговора.Контрагент КАК Контрагент,
		|	ОКР(ВЫБОР
		|		КОГДА ДоговораПервыеДатыДоговора.ТекущаяДатаПервогоДоговора = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 0
		|		ИНАЧЕ РАЗНОСТЬДАТ(ДоговораПервыеДатыДоговора.ТекущаяДатаПервогоДоговора, &ТекущаяДата, ДЕНЬ)
		|	КОНЕЦ / 365 - 0.05, 1) КАК ТекущееКоличествоЛетРаботы,
		|	ДоговораПервыеДатыДоговора.ТекущаяДатаПервогоДоговора КАК ТекущаяДатаПервогоДоговора,
		|	ДоговораПервыеДатыДоговора.НомерВерсииПоследнегоРасчета КАК НомерВерсииПоследнегоРасчета
		|ПОМЕСТИТЬ ВТ_КонтрагентыКоличествоДнейРаботы
		|ИЗ
		|	ВТ_ДоговораПервыеДатыДоговора КАК ДоговораПервыеДатыДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.Период КАК Период,
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.НомерВерсии КАК НомерВерсии,
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.АнкетаКонтрагента КАК АнкетаКонтрагента,
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.КоэффициентСтруктурыСобственности КАК
		|		КоэффициентСтруктурыСобственности,
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.ДатаПервогоДоговора КАК ДатаПервогоДоговора,
		|	афлКачественныеКоэффициентыКонтрагентовСрезПоследних.КоличествоЛетРаботы КАК КоличествоЛетРаботы
		|ПОМЕСТИТЬ ВТ_КачественныеКоэффициентыПоследнийРасчет
		|ИЗ
		|	РегистрСведений.афлКачественныеКоэффициентыКонтрагентов.СрезПоследних(&ТекущаяДата, (АнкетаКонтрагента, НомерВерсии)
		|		В
		|		(ВЫБРАТЬ
		|			ВтКонтрагентыПоследниеРасчеты.АнкетаКонтрагента КАК АнкетаКонтрагента,
		|			ВтКонтрагентыПоследниеРасчеты.НомерВерсииПоследнегоРасчета КАК НомерВерсииПоследнегоРасчета
		|		ИЗ
		|			ВТ_КонтрагентыПоследниеРасчеты КАК ВтКонтрагентыПоследниеРасчеты)) КАК
		|		афлКачественныеКоэффициентыКонтрагентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВтКонтрагентыПоследниеРасчеты.АнкетаКонтрагента КАК АнкетаКонтрагента,
		|	ВтКачественныеКоэффициентыПоследнийРасчет.КоэффициентСтруктурыСобственности КАК КоэффициентСтруктурыСобственности,
		|	ВтКачественныеКоэффициентыПоследнийРасчет.ДатаПервогоДоговора КАК ДатаПервогоДоговора,
		|	ВтКачественныеКоэффициентыПоследнийРасчет.КоличествоЛетРаботы КАК КоличествоЛетРаботы,
		|	ВтКонтрагентыПоследниеРасчеты.Контрагент КАК Контрагент,
		|	ВтКачественныеКоэффициентыПоследнийРасчет.НомерВерсии КАК НомерВерсии,
		|	ВтКачественныеКоэффициентыПоследнийРасчет.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаПоследнихРасчетов
		|ИЗ
		|	ВТ_КонтрагентыПоследниеРасчеты КАК ВтКонтрагентыПоследниеРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КачественныеКоэффициентыПоследнийРасчет КАК ВтКачественныеКоэффициентыПоследнийРасчет
		|		ПО ВтКонтрагентыПоследниеРасчеты.АнкетаКонтрагента = ВтКачественныеКоэффициентыПоследнийРасчет.АнкетаКонтрагента
		|		И ВтКонтрагентыПоследниеРасчеты.ДатаПоследенегоРасчета = ВтКачественныеКоэффициентыПоследнийРасчет.Период
		|		И ВтКонтрагентыПоследниеРасчеты.НомерВерсииПоследнегоРасчета = ВтКачественныеКоэффициентыПоследнийРасчет.НомерВерсии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПоследнихРасчетов.АнкетаКонтрагента КАК АнкетаКонтрагента,
		|	ЕСТЬNULL(ВтКонтрагентыКоличествоДнейРаботы.ТекущееКоличествоЛетРаботы, 0) КАК ТекущееКоличествоЛетРаботыДляПересчета,
		|	ЕСТЬNULL(ВтКонтрагентыКоличествоДнейРаботы.ТекущаяДатаПервогоДоговора, 0) КАК ТекущаяДатаПервогоДоговора,
		|	ТаблицаПоследнихРасчетов.НомерВерсии КАК НомерВерсии,
		|	ВтКонтрагентыКоличествоДнейРаботы.ТекущаяДатаПервогоДоговора КАК ТекущаяДатаПервогоДоговора1,
		|	ВтКонтрагентыКоличествоДнейРаботы.ТекущееКоличествоЛетРаботы КАК ТекущееКоличествоЛетРаботы,
		|	ТаблицаПоследнихРасчетов.ДатаПервогоДоговора КАК ДатаПервогоДоговора,
		|	ТаблицаПоследнихРасчетов.КоличествоЛетРаботы КАК КоличествоЛетРаботы,
		|	ТаблицаПоследнихРасчетов.Период КАК Период,
		|	ВтКонтрагентыКоличествоДнейРаботы.Контрагент КАК Контрагент,
		|	ВтКонтрагентыКоличествоДнейРаботы.ТекущееКоличествоЛетРаботы КАК ТекущееКоличествоЛетРаботы1,
		|	ВтКонтрагентыКоличествоДнейРаботы.ТекущаяДатаПервогоДоговора КАК ТекущаяДатаПервогоДоговора2
		|ИЗ
		|	ВТ_ТаблицаПоследнихРасчетов КАК ТаблицаПоследнихРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыКоличествоДнейРаботы КАК ВтКонтрагентыКоличествоДнейРаботы
		|		ПО ТаблицаПоследнихРасчетов.Контрагент = ВтКонтрагентыКоличествоДнейРаботы.Контрагент
		|		И ТаблицаПоследнихРасчетов.НомерВерсии = ВтКонтрагентыКоличествоДнейРаботы.НомерВерсииПоследнегоРасчета
		|ГДЕ
		|	ВтКонтрагентыКоличествоДнейРаботы.ТекущаяДатаПервогоДоговора <> ТаблицаПоследнихРасчетов.ДатаПервогоДоговора
		|	ИЛИ ТаблицаПоследнихРасчетов.КоличествоЛетРаботы <> ВтКонтрагентыКоличествоДнейРаботы.ТекущееКоличествоЛетРаботы";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());