Организация = ДанныеЗаполнения.Организация;
Банк = ДанныеЗаполнения.афлБанкУНК;
БанковскийСчет = ДанныеЗаполнения.СчетКассаОрганизации;
СтрокаВалютнойОперации = ВалютныеОперации.Добавить();
СтрокаВалютнойОперации.Документ = ДанныеЗаполнения.Номер;
СтрокаВалютнойОперации.ВидВалютнойОперации = ДанныеЗаполнения.ВидВалютнойОперации;
СтрокаВалютнойОперации.СуммаОперации = ДанныеЗаполнения.СуммаДокумента;
СтрокаВалютнойОперации.афлВалютаПлатежа = ДанныеЗаполнения.ВалютаВзаиморасчетов;
СтрокаВалютнойОперации.афлДоговор = ДанныеЗаполнения.ДоговорКонтрагента;
СтрокаВалютнойОперации.афлУНК1 = ДанныеЗаполнения.афлНомерУНК1;
СтрокаВалютнойОперации.афлУНК2 = ДанныеЗаполнения.афлНомерУНК2;
СтрокаВалютнойОперации.афлУНК3 = ДанныеЗаполнения.афлНомерУНК3;
СтрокаВалютнойОперации.афлУНК4 = ДанныеЗаполнения.афлНомерУНК4;
СтрокаВалютнойОперации.афлУНК5 = ДанныеЗаполнения.афлНомерУНК5;

///////////////////////////////////////////////////////////////////

Организация = ДанныеЗаполнения.Организация;
СтрокаВалютнойОперации = ВалютныеОперации.Добавить();
СтрокаВалютнойОперации.Документ = ДанныеЗаполнения.Номер;
СтрокаВалютнойОперации.афлДоговор = ДанныеЗаполнения;
СтрокаВалютнойОперации.афлДатаДоговора = ДанныеЗаполнения.ДатаНачалаДействия;
СтрокаВалютнойОперации.афлВалютаКонтракта = ДанныеЗаполнения.ВалютаВзаиморасчетов;
Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор") Тогда
    СтрокаВалютнойОперации.афлВнешнийНомерДоговора = ДанныеЗаполнения.афлВнешнийНомер;
Иначе
    СтрокаВалютнойОперации.афлВнешнийНомерДоговора = ДанныеЗаполнения.ВерсияСоглашения.афлВнешнийНомер;
КонецЕсли;
НомерУНК = ДанныеЗаполнения.УникальныйНомерВалютногоКонтроля;
СтрокаВалютнойОперации.афлУНК1 = Лев(НомерУНК, 8);
СтрокаВалютнойОперации.афлУНК2 = Сред(НомерУНК, 10, 4);
СтрокаВалютнойОперации.афлУНК3 = Сред(НомерУНК, 15, 4);
СтрокаВалютнойОперации.афлУНК4 = Сред(НомерУНК, 20, 1);
СтрокаВалютнойОперации.афлУНК5 = Прав(НомерУНК, 1);



	// АФЛ Казначейство
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор")
        Или ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
            афлЗаполнитьПоВерсияСоглашенияКоммерческийДоговор(ДанныеЗаполнения);
        КонецЕсли;
        // АФЛ Казначейство

// АФЛ Казначейство
// 
// Параметры:
//  ДанныеЗаполнения - СправочникСсылка.ДоговорыКонтрагентов, ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор - Данные заполнения
Процедура афлЗаполнитьПоВерсияСоглашенияКоммерческийДоговор(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор") Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
			|	ВерсияСоглашенияКоммерческийДоговор.Номер КАК Документ,
			|	ВерсияСоглашенияКоммерческийДоговор.Ссылка КАК афлДоговор,
			|	ВерсияСоглашенияКоммерческийДоговор.ДатаНачалаДействия КАК афлДатаДоговора,
			|	ВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК афлВалютаКонтракта,
			|	ВерсияСоглашенияКоммерческийДоговор.афлВнешнийНомер КАК афлВнешнийНомерДоговора,
			|	ВерсияСоглашенияКоммерческийДоговор.УникальныйНомерВалютногоКонтроля КАК НомерУНК
			|ИЗ
			|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
			|ГДЕ
			|	ВерсияСоглашенияКоммерческийДоговор.Ссылка = &Ссылка";
			
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
			|	ВерсияСоглашенияКоммерческийДоговор.Номер КАК Документ,
			|	ВерсияСоглашенияКоммерческийДоговор.Ссылка КАК афлДоговор,
			|	ВерсияСоглашенияКоммерческийДоговор.ДатаНачалаДействия КАК афлДатаДоговора,
			|	ВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК афлВалютаКонтракта,
			|	ВерсияСоглашенияКоммерческийДоговор.афлВнешнийНомер КАК афлВнешнийНомерДоговора,
			|	ВерсияСоглашенияКоммерческийДоговор.УникальныйНомерВалютногоКонтроля КАК НомерУНК
			|ИЗ
			|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
			|ГДЕ
			|	ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента = &Ссылка"
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Организация = Выборка.Организация;
		
		СтрокаВалютнойОперации = ВалютныеОперации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВалютнойОперации, Выборка);
		
		НомерУНК = Выборка.НомерУНК;
		СтрокаВалютнойОперации.афлУНК1 = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Лев(НомерУНК, 8));
		СтрокаВалютнойОперации.афлУНК2 = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(НомерУНК, 10, 4));
		СтрокаВалютнойОперации.афлУНК3 = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(НомерУНК, 15, 4));
		СтрокаВалютнойОперации.афлУНК4 = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(НомерУНК, 20, 1));
		СтрокаВалютнойОперации.афлУНК5 = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Прав(НомерУНК, 1));
		
	КонецЦикла;
	
КонецПроцедуры
// АФЛ Казначейство