ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.СчетаУчетаРасчетовСКонтрагентами КАК СчетаУчетаРасчетовСКонтрагентами
ИЗ
	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		ПОЛНОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаРасчетаСКонтрагентами КАК афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами
		ПО (афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.Ссылка)
ГДЕ
	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.СчетаУчетаФинОбеспПолученного КАК СчетаУчетаФинОбеспПолученного
ИЗ
	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		ПОЛНОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаФинансовогоОбеспеченияПолученного КАК афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного
		ПО афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.Ссылка
ГДЕ
	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
	афлУстановкаПараметровКонтроляЛимитовТипыДоговора.ТипДоговора КАК ТипДоговора
ИЗ
	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		ПОЛНОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.ТипыДоговора КАК афлУстановкаПараметровКонтроляЛимитовТипыДоговора
		ПО (афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовТипыДоговора.Ссылка)
ГДЕ
	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
	афлУстановкаПараметровКонтроляЛимитов.СрокОтсрочки КАК СрокОтсрочки
ИЗ
	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
ГДЕ
	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
	афлУстановкаПараметровКонтроляЛимитов.СтатусИсполнения КАК СтатусИсполнения,
	афлУстановкаПараметровКонтроляЛимитов.СтатусСогласования КАК СтатусСогласования,
	афлУстановкаПараметровКонтроляЛимитов.ПорогПредупрежденияВПроцентах КАК ПорогПредупрежденияВПроцентах,
	афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора.СтатусДоговора КАК СтатусДоговора
ИЗ
	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		ПОЛНОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СтатусыДоговора КАК афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора
		ПО афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора.Ссылка
ГДЕ
	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка

	
	Далее работаем с результатом как с массивом:

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка1 = МассивРезультатов[0].Выбрать();
	
	Если Выборка1.Следующий() Тогда
	
	//Действия с выборкой 1
	
	КонецЕсли;
	
	ВыборкаВидыСубконто = МассивРезультатов[1].Выбрать();