Движения.афлПоказателиПараметровКонтроляЛимитов.Записывать 	= Истина;
	Движения.афлСрокОтсрочкиКонтроляЛимитов.Записывать 			= Истина;
	Движения.афлСчетаУчетаРасчетовСКонтрагентами.Записывать 	= Истина;
	Движения.афлСчетаУчетаФО.Записывать 						= Истина;
	Движения.афлТипыДоговоровКонтроляЛимитов.Записывать 		= Истина;
	Движения.афлСчетаИсключенияИстория.Записывать 				= Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ДатаНачала КАК ДатаНачала,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.КодСчета КАК КодСчета
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаРасчетаСКонтрагентами КАК
		|			афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами
		|		ПО (афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСчетаУчетаРасчетаСКонтрагентами.Ссылка)
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ДатаНачала КАК ДатаНачала,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.КодСчета КАК КодСчета
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаУчетаФинансовогоОбеспеченияПолученного КАК
		|			афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного
		|		ПО афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСчетаУчетаФинансовогоОбеспеченияПолученного.Ссылка
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитовТипыДоговора.ТипДоговора КАК ТипДоговора
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.ТипыДоговора КАК
		|			афлУстановкаПараметровКонтроляЛимитовТипыДоговора
		|		ПО (афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовТипыДоговора.Ссылка)
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитов.СрокОтсрочки КАК СрокОтсрочки
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитов.ПорогПредупрежденияВПроцентах КАК ПорогПредупрежденияВПроцентах,
		|	афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора.СтатусДоговора КАК СтатусДоговора,
		|	афлУстановкаПараметровКонтроляЛимитов.СтатусИсполнения КАК СтатусИсполнения,
		|	афлУстановкаПараметровКонтроляЛимитов.СтатусСогласования КАК СтатусСогласования
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СтатусыДоговора КАК
		|			афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора
		|		ПО афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСтатусыДоговора.Ссылка
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Дата КАК Период,
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка КАК Регистратор,
		|	афлУстановкаПараметровКонтроляЛимитов.Организация КАК Организация,
		|	афлУстановкаПараметровКонтроляЛимитов.ВидЛимита КАК ВидЛимита,
		|	афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.КодСчета КАК СчетаИсключения
		|ИЗ
		|	Документ.афлУстановкаПараметровКонтроляЛимитов КАК афлУстановкаПараметровКонтроляЛимитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.афлУстановкаПараметровКонтроляЛимитов.СчетаИсключения КАК
		|			афлУстановкаПараметровКонтроляЛимитовСчетаИсключения
		|		ПО афлУстановкаПараметровКонтроляЛимитов.Ссылка = афлУстановкаПараметровКонтроляЛимитовСчетаИсключения.Ссылка
		|ГДЕ
		|	афлУстановкаПараметровКонтроляЛимитов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаСчетаУчетаРасчетовСКонтрагентами 	= МассивРезультатов[0].Выбрать();
	ВыборкаСчетаУчетаФО 						= МассивРезультатов[1].Выбрать();
	ВыборкаПоказателиПараметровКонтроляЛимитов 	= МассивРезультатов[4].Выбрать();
	
	Пока ВыборкаСчетаУчетаРасчетовСКонтрагентами.Следующий() Цикл
		Движение = Движения.афлСчетаУчетаРасчетовСКонтрагентами.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаСчетаУчетаРасчетовСКонтрагентами);	
	КонецЦикла;
	
	Пока ВыборкаСчетаУчетаФО.Следующий() Цикл
		Движение = Движения.афлСчетаУчетаФО.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаСчетаУчетаФО);
	КонецЦикла;
	
	Пока ВыборкаПоказателиПараметровКонтроляЛимитов.Следующий() Цикл
		Движение = Движения.афлПоказателиПараметровКонтроляЛимитов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаПоказателиПараметровКонтроляЛимитов);
	КонецЦикла;
	
	Если ВидЛимита = ПредопределенноеЗначение("Перечисление.афлВидыЛимитов.ЛимитДЗ") Тогда
		
		ВыборкаТипыДоговоровКонтроляЛимитов = МассивРезультатов[2].Выбрать();
		ВыборкаСрокОтсрочкиКонтроляЛимитов 	= МассивРезультатов[3].Выбрать();
		ВыборкаСчетаИсключения				= МассивРезультатов[5].Выбрать();
		
		Пока ВыборкаТипыДоговоровКонтроляЛимитов.Следующий() Цикл
			Движение = Движения.афлТипыДоговоровКонтроляЛимитов.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаТипыДоговоровКонтроляЛимитов);
		КонецЦикла;
		
		Пока ВыборкаСрокОтсрочкиКонтроляЛимитов.Следующий() Цикл
			Движение = Движения.афлСрокОтсрочкиКонтроляЛимитов.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаСрокОтсрочкиКонтроляЛимитов);
		КонецЦикла;
		
		Пока ВыборкаСчетаИсключения.Следующий() Цикл
			Движение = Движения.афлСчетаИсключенияИстория.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаСчетаИсключения);
		КонецЦикла;
	КонецЕсли;



	// Проверка Дат

	Если Объект.ДатаНачала < Объект.Дата Тогда
			
		Отказ = Истина;
		
		ШаблонСообщения = НСтр("ru= 'Дата начала %1, не может быть меньше даты создания документа %2'");
		СообщениеСтр = СтрШаблон(ШаблонСообщения, Формат(Объект.ДатаНачала, "ДЛФ = Д"), Формат(Объект.Дата, "ДЛФ = Д"));
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СообщениеСтр;
		Сообщение.Поле = "Объект.ДатаНачала";
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	//